-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               5.6.25 - MySQL Community Server (GPL)
-- Server OS:                    Win64
-- HeidiSQL Version:             9.3.0.4984
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- Dumping database structure for myhomelibrary
CREATE DATABASE IF NOT EXISTS `myhomelibrary` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `myhomelibrary`;


-- Dumping structure for table myhomelibrary.books
CREATE TABLE IF NOT EXISTS `books` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `ISBN` varchar(13) DEFAULT NULL,
  `name` varchar(1024) DEFAULT NULL,
  `doubanID` varchar(20) DEFAULT NULL,
  `imageID` varchar(200) DEFAULT NULL,
  `author` varchar(1024) DEFAULT NULL,
  `pages` varchar(15) DEFAULT '0',
  `price` varchar(50) DEFAULT NULL,
  `publisher` varchar(1024) DEFAULT NULL,
  `translator` varchar(1024) DEFAULT NULL,
  `pubdate` varchar(10) DEFAULT NULL,
  `modifiedDate` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `placeID` int(10) unsigned DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8;

-- Dumping data for table myhomelibrary.books: ~2 rows (approximately)
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` (`id`, `ISBN`, `name`, `doubanID`, `imageID`, `author`, `pages`, `price`, `publisher`, `translator`, `pubdate`, `modifiedDate`, `placeID`) VALUES
	(1, '9787806793787', '天真妈妈', '1143793', 's8887147.jpg', '杨红樱', '166', '13.80元', '接力出版社', '', '2004-2', '2017-06-12 22:26:49', 1),
	(2, '9787806793794', '漂亮女孩夏林果', '1143869', 's1218928.jpg', '杨红樱', '172', '13.00', '接力出版社', '', '2004-2-1', '2017-06-12 22:27:51', 1),
	(3, '9787544806138', '小英雄和芭蕾公主', '3419707', 's8877575.jpg', '杨红樱', '166', '13.80元', '接力', '', '2009-1', '2017-06-12 22:27:59', 1),
	(4, '9787806799512', '巨人的城堡', '1416197', 's1526071.jpg', '杨红樱', '170', '13.00元', '接力出版社', '', '2005-8', '2017-06-12 22:28:07', 1),
	(5, '9787806793800', '丁克舅舅', '1252547', 's8871981.jpg', '杨红樱', '164', '13.80元', '接力出版社', '', '2004-2', '2017-06-12 22:28:14', 1),
	(6, '9787806792223', '淘气包马小跳系列:笨女孩安琪儿', '1119980', 's8905011.jpg', '杨红樱', '166', '13.0', '接力出版社', '', '2003-7', '2017-06-12 22:28:22', 1),
	(7, '9787806794869', '小大人丁文涛', '1254504', 's5905864.jpg', '杨红樱', '178', '13.80元', '接力出版社', '', '2004-6', '2017-06-12 22:28:34', 1),
	(8, '9787806794845', '疯丫头杜真子', '1162370', 's8456646.jpg', '杨红樱', '164', '13.00元', '接力出版社', '', '2004-6', '2017-06-12 22:28:41', 1),
	(9, '9787807328476', '名叫牛皮的插班生', '2175926', 's2950092.jpg', '杨红樱', '178', '13.00元', '接力出版社', '', '2007', '2017-06-12 22:28:49', 1),
	(10, '9787806792704', '四个调皮蛋', '1248684', 's8887152.jpg', '杨红樱', '162', '13.00元', '接力出版社', '', '2003-8-1', '2017-06-12 22:28:56', 1),
	(11, '9787806792247', '贪玩老爸', '1245777', 's1257142.jpg', '杨红樱', '157', '13.80元', '接力出版社', '', '2004-4', '2017-06-12 22:29:03', 1),
	(12, '9787806792162', '轰隆隆老师', '1120014', 's5915445.jpg', '杨红樱', '166', '13.00元', '接力出版社', '', '2004-4', '2017-06-12 22:29:16', 1),
	(13, '9787806792728', '暑假奇遇', '1248686', 's1223963.jpg', '杨红樱', '158', '13.0', '接力出版社', '', '2011-1', '2017-06-12 22:29:22', 1),
	(14, '9787807324478', '跳跳电视台', '1844857', 's10050054.jpg', '杨红樱', '168', '13.0', '接力出版社', '', '2006-8', '2017-06-12 22:29:31', 1),
	(15, '9787806792711', '同桌冤家', '1248685', 's26597602.jpg', '杨红樱', '158', '13.80元', '接力出版社', '', '2003-8-1', '2017-06-12 22:29:38', 1),
	(16, '9787807324485', '超级市长', '1844858', 's8456666.jpg', '杨红樱', '186', '13.80元', '接力出版', '', '2004-2', '2017-06-12 22:29:44', 1),
	(17, '9787807328469', '开甲壳虫车的女校长', '2181353', 's5908310.jpg', '杨红樱', '194', '13.80元', '接力出版', '', '2007-8', '2017-06-12 22:29:49', 1),
	(18, '9787806799505', '寻找大熊猫', '1416196', 's9114388.jpg', '杨红樱', '170', '13.80元', '接力出版社', '', '2005-8', '2017-06-12 22:29:55', 1),
	(19, '9787544802895', '侦探小组在行动', '3115952', 's3274033.jpg', '杨红樱', '178', '13.80元', '接力出版社', '', '2008', '2017-06-12 22:30:01', 1),
	(20, '9787806794852', '宠物集中营', '1162162', 's1170894.jpg', '杨红樱', '176', '13.00元', '接力出版社', '', '2004-6-1', '2017-06-12 22:30:10', 1),
	(23, '9787547700143', '福尔摩斯探案系列1-10', '5033743', 's27403235.jpg', '阿瑟·柯南道尔 (Arther Conan Doyle)', '1890', '11.80元', '北京日报报业集团，同心出版社', '水泓', '2010-8-1', '2017-06-12 22:33:51', 1),
	(24, '9787533268589', '我不想不想长大', '10788999', 's10407478.jpg', '', '0', '16.00元', '', '', '', '2017-06-12 22:36:47', 1),
	(25, '9787539138954', '森林报-夏', '2298456', 's2757510.jpg', '(苏联)维·比安基', '192', '12.00元', '', '王汶', '2007年10月', '2017-06-12 22:38:27', 1),
	(26, '9787539138978', '森林报-冬', '2298458', 's2757512.jpg', '(苏联)维·比安基', '145', '12.00元', '二十一世纪出版社', '王汶', '2007年10月', '2017-06-12 22:38:34', 1),
	(27, '9787506323062', '男生日记', '1007396', 's1150479.jpg', '杨红樱', '284', '15.00元', '作家出版社', '', '2004-7', '2017-06-12 22:38:41', 1),
	(28, '9787208113152', '百分之七溶液', '22748877', 's26817135.jpg', '(美)尼古拉斯·迈耶', '256', '29.8', '世纪文景/上海人民出版社', '卓妙容', '2013-8', '2017-06-12 22:43:58', 1),
	(29, '9787534256288', '雪豹悲歌', '4061965', 's8831600.jpg', '沈石溪', '249', '17.00元', '浙江少年儿童出版社', '', '2009-10', '2017-06-12 22:44:20', 1),
	(30, '9787538637922', '警犬拉拉', '4748656', 's6180091.jpg', '沈石溪', '232', '18.00元', '吉林美术出版社', '', '2010-4', '2017-06-12 22:44:26', 1),
	(31, '9787562465652', '大秘密', '10537654', 's16235530.jpg', '(英) 爱德华·菲利普斯·奥本海默,Edward Phillips Oppenheim', '254', '24.00元', '重庆大学出版社', '孟军', '2012-7', '2017-06-12 22:44:34', 1),
	(32, '9787541824746', '童年', '3945039', 's23386015.jpg', '', '0', '10.00元', '', '', '', '2017-06-12 22:45:06', 1),
	(33, '9787805671710', '米老鼠', '3023780', 's2985590.jpg', '(美)迪斯尼(Disney,V.)作', '232', '', '译林出版社', '', '1992', '2017-06-12 22:45:15', 1),
	(34, '9781408810569', 'Harry Potter and the Prisoner of Azkaban', '5915263', 's5488711.jpg', 'J.K. Rowling', '320', '£6.99', 'Bloomsbury Publishing Plc', '', '2010-11', '2017-06-12 22:45:51', 1),
	(35, '9787506475013', '老人与海', '6689725', 's6863611.jpg', '(美)海明威|译者:易尚|绘画:雾河小舟', '152', '16.80元', '中国纺织', '', '2011-7', '2017-06-12 22:45:57', 1),
	(36, '9787506475082', '昆虫记', '6715141', 's6912613.jpg', '(法)让·亨利·法布尔|译者:易尚|绘画:雾河小舟', '193', '19.80元', '中国纺织', '易尚', '2011-7', '2017-06-12 22:46:05', 1),
	(37, '9787539146201', '三国演义', '3601846', 's6000399.jpg', '罗贯中', '282', '19.80元', '二十一世纪', '', '2009-2', '2017-06-12 22:48:18', 1),
	(38, '9787532523719', '三国演义（上下）', '1203406', 's1146601.jpg', '罗贯中', '864', '38.00', '上海古籍出版社', '', '1998-7-1', '2017-06-12 22:48:29', 1),
	(39, '9787020057177', '中外神话传说', '1834296', 's8898460.jpg', '田新利', '166', '9.00元', '人民文学', '', '2001-8', '2017-06-12 22:48:35', 1),
	(40, '9787802053908', '绿野仙踪', '2196130', 's10305343.jpg', '莱曼.弗兰克.鲍姆', '198', '12.00元', '开明', '', '2007-6', '2017-06-12 22:48:43', 1),
	(41, '9787806395868', '小王子（中英文对照本）', '1021615', 's1471658.jpg', '[法国] 安东·德·圣艾修伯里', '193', '19.80元', '哈尔滨出版社', '艾柯', '2001-11', '2017-06-12 22:48:50', 1),
	(42, '9787806802502', '气球上的五星期', '1258563', 's9947289.jpg', '[法国] 儒勒·凡尔纳', '294', '15.00元', '太白文艺出版社', '陈琳', '2005-1', '2017-06-12 22:48:56', 1),
	(43, '9787020060726', '奇怪的病号', '2151798', 's5768572.jpg', '叶永烈', '192', '13.00元', '人民文学', '', '2007-6', '2017-06-12 22:49:04', 1),
	(44, '9787020060689', '小灵通漫游未来', '2151345', 's10144530.jpg', '叶永烈', '312', '17.0', '人民文学出版社', '', '2007-6', '2017-06-12 22:49:12', 1),
	(46, '9787539131856', '水浒传', '1743149', 'https://img1.doubanio.com/f/shire/5522dd1f5b742d1e1394a17f44d590646b63871d/pics/book-default-medium.gif', '施耐庵', '247 页', '18.0', '二十一世纪出版社', '', '2006年01月', '2017-06-12 22:58:20', 1),
	(47, '9787805675312', '安徒生童话选集', '1010779', 's2407949.jpg', '(丹麦)汉·克·安徒生著、叶君健译', '407', '13.00', '译林出版社', '叶君健', '1994-08', '2017-06-12 22:58:37', 1),
	(48, '9787500115885', '苦儿流浪记', '1854217', 's8831186.jpg', '(法)埃克多·马洛', '174', '10.80元', '中国对外翻译出版公司', '', '2006-5', '2017-06-12 22:58:52', 1),
	(49, '9787542725585', '火星之旅', '1145442', 's6848215.jpg', '泰里·比森', '285', '16.00元', '上海科学普及出版社', '', '2004-1', '2017-06-12 22:58:59', 1),
	(50, '9787534638718', '草房子', '2262925', 's9023544.jpg', '曹文轩', '292', '29.00元', '江苏少年儿童出版社', '', '2007-8', '2017-06-12 22:59:05', 1),
	(51, '9787545500950', '金银岛', '3991438', 's6062206.jpg', '', '167', '16.50元', '', '', '2009-7', '2017-06-12 22:59:16', 1),
	(52, '9787546201764', '尼魔岛（全二册）', '4583030', 's6172346.jpg', '(澳大利亚)温蒂·欧尔 文,(澳大利亚)凯莉·米拉德 图', '363', '36.00元', '广州出版社', '陈咨羽', '2010年5月', '2017-06-12 22:59:22', 1),
	(53, '9787546201764', '尼魔岛（全二册）', '4583030', 's6172346.jpg', '(澳大利亚)温蒂·欧尔 文,(澳大利亚)凯莉·米拉德 图', '363', '36.00元', '广州出版社', '陈咨羽', '2010年5月', '2017-06-12 22:59:43', 1),
	(54, '9787533869465', '生活大发现', '2116736', 's5766695.jpg', '咸允美', '135', '19.00元', '浙江教育出版社', '金炫辰', '2007-4', '2017-06-12 23:00:07', 1);
/*!40000 ALTER TABLE `books` ENABLE KEYS */;


-- Dumping structure for table myhomelibrary.place
CREATE TABLE IF NOT EXISTS `place` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `place` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

-- Dumping data for table myhomelibrary.place: ~8 rows (approximately)
/*!40000 ALTER TABLE `place` DISABLE KEYS */;
INSERT INTO `place` (`id`, `place`) VALUES
	(0, '书房右侧书架1层'),
	(1, '书房右侧书架2层'),
	(2, '书房右侧书架3层'),
	(3, '书房右侧书架4层'),
	(4, '书房左侧书架1层'),
	(5, '书房左侧书架2层'),
	(6, '书房左侧书架3层'),
	(7, '书房左侧书架4层');
/*!40000 ALTER TABLE `place` ENABLE KEYS */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
